app/views/services/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
      <hr>
      <p><b>Posted By:</b> <a href="/users/<%=@service.user.id%>"><%= @service.user.first_name.capitalize + ' ' + @service.user.last_name.capitalize %></a></p>

SELECT COUNT(*) FROM "service_users" WHERE "service_users"."service_id" = $1  [["service_id", 3]]
---
              <table style="width:50%;text-align:center;background-color:#dfdfdf">
                <% if @service.service_users.size == 0%>

SELECT  1 AS one FROM "service_users" WHERE "service_users"."service_id" = $1 AND "service_users"."user_id" = $2 LIMIT $3  [["service_id", 2], ["user_id", 1], ["LIMIT", 1]]
---
          <% elsif @user.is_teen?%>
              <% if @service.service_users.exists?(:user_id => current_user.id) %>

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      <% elsif @service.status == Service::ACCEPTED %>
          <% @acceptedUser = User.find(@service.service_users.first.user_id) %>