TeenServ/app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    if current_user
      @user = User.find(current_user.id)