TeenServ/app/controllers/services_controller.rb

SELECT "services".* FROM "services"
---
	def index
		@services = Service.all()