TeenServ/app/controllers/services_controller.rb

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def show
		@service = Service.find(params[:id])

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
		@service = Service.find(params[:id])

INSERT INTO "services" ("user_id", "title", "charge_per_hour", "created_at", "updated_at", "status", "frequency") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 2], ["title", "Furniture moving"], ["charge_per_hour", 6.0], ["created_at", "2017-10-29 00:38:26.982178"], ["updated_at", "2017-10-29 00:38:26.982178"], ["status", 0], ["frequency", 0]]
---
	def create
		@service = Service.new(service_params)
		if @service.save

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 4]]
---
	def destroy
		@service = Service.find(params[:id])
		userId = @service.user_id
		@service.destroy

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "services" SET "status" = $1, "updated_at" = $2 WHERE "services"."id" = $3  [["status", 1], ["updated_at", "2017-11-11 03:53:16.498885"], ["id", 2]]
---
	def list
		@service = Service.find(params[:id])
		@service.update({:status => Service::LISTED});

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "services" SET "status" = $1, "updated_at" = $2 WHERE "services"."id" = $3  [["status", 0], ["updated_at", "2017-11-18 22:38:48.349522"], ["id", 6]]
---
	def unlist
		@service = Service.find(params[:id])
		if(@service.status == Service::LISTED || @service.status == Service::ACCEPTED)
			@service.service_users.destroy_all
			@service.update({:status => Service::UNLISTED});

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "service_users" ("user_id", "service_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["service_id", 2], ["created_at", "2017-11-11 04:02:41.221610"], ["updated_at", "2017-11-11 04:02:41.221610"]]
---
	def add_request
		@service = Service.find(params[:id])

		# Validation booleans to make sure user can be considered for this service
		# A user cannot place a request on a service that they created
		serviceUserIsCurrentUser = @service.user_id == current_user.id;
		# A user cannot place a request on a service that is created by another user of the same group
		serviceUserIsSameTypeAsServiceCreator = @service.user.group == current_user.group;
		#TODO: Add a validation check for Service::LISTED

		if(serviceUserIsCurrentUser || serviceUserIsSameTypeAsServiceCreator)
			#TODO: Return error if somehow user is trying to request their own service
			puts "ERROR! Unexpected Service Behaviour!"
			redirect_to (services_path)
		else
			@service.service_users.create service_id: @service.id, user_id: current_user.id

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "service_users" WHERE "service_users"."service_id" = $1 AND "service_users"."user_id" = $2 LIMIT $3  [["service_id", 2], ["user_id", 5], ["LIMIT", 1]]
SELECT "service_users".* FROM "service_users" WHERE "service_users"."service_id" = $1  [["service_id", 2]]
DELETE FROM "service_users" WHERE "service_users"."id" = $1  [["id", 1]]
UPDATE "services" SET "status" = $1, "updated_at" = $2 WHERE "services"."id" = $3  [["status", 2], ["updated_at", "2017-11-11 04:03:16.734781"], ["id", 2]]
---
	def select_request
		@service = Service.find(params[:id])
		selectedUserId = params[:userId]

		# logic validation checks
		serviceUserIsCurrentUser = @service.user_id == current_user.id;
		selectedUserExistsInServiceRequests = @service.service_users.exists?(:user_id => selectedUserId)
		serviceIsListed = @service.status == Service::LISTED
		if serviceUserIsCurrentUser && selectedUserExistsInServiceRequests && serviceIsListed
			# delete all the other requests
			@service.service_users.each do |relation|
				if(relation.user_id != selectedUserId)
					@service.service_users.destroy(relation)
				end
			end
			@service.update({:status => Service::ACCEPTED});

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
	def find_user
		if params[:user_id]
			@user = User.find(params[:user_id])