TeenServ/app/controllers/teen_times_controller.rb

  def create
    @teenTime = TeenTime.new(user_id: @user.id, day: params[:day], start_time: params[:start_time], end_time: params[:end_time])
    @teenTime.save
---
INSERT INTO "teen_times" ("user_id", "day", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["day", "Monday"], ["start_time", "09:00:00"], ["end_time", "11:00:00"], ["created_at", "2017-11-11 20:00:59.423167"], ["updated_at", "2017-11-11 20:00:59.423167"]]

  def destroy
    if params[:start_time]
      TeenTime.where(:user_id => @user.id).where(:day => params[:day]).where(:start_time => Time.parse(params[:start_time]).strftime("%H:%M")).where(:end_time => Time.parse(params[:end_time]).strftime("%H:%M")).destroy_all
    else
      TeenTime.where(:user_id => @user.id).where(:day => params[:day]).destroy_all
---
DELETE FROM "teen_times" WHERE "teen_times"."id" = $1  [["id", 5]]
SELECT "teen_times".* FROM "teen_times" WHERE "teen_times"."user_id" = $1 AND "teen_times"."day" IS NULL AND "teen_times"."start_time" = $2 AND "teen_times"."end_time" = $3  [["user_id", 2], ["start_time", "0009-01-01 05:00:00"], ["end_time", "0011-01-01 05:00:00"]]
SELECT "teen_times".* FROM "teen_times" WHERE "teen_times"."user_id" = $1 AND "teen_times"."day" = $2  [["user_id", 2], ["day", "Friday"]]

  def find_user
      @user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]