TeenServ/app/controllers/user_steps_controller.rb

UPDATE "users" SET "address_1" = $1, "address_2" = $2, "city" = $3, "province" = $4, "postal_code" = $5, "country" = $6, "home_number" = $7, "mobile_number" = $8, "latitude" = $9, "longitude" = $10, "updated_at" = $11 WHERE "users"."id" = $12
---
  def update
    @user = current_user
    #@user.attributes = params[:user]
    @user.update_attributes(user_params)