TeenServ/app/controllers/users_controller.rb

	def add_user
		User.create(add_user_params)
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "address_1", "address_2", "city", "province", "postal_code", "country", "home_number", "mobile_number", "age", "group", "first_name", "last_name", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"

  def login_as
    @users = User.all
---
SELECT "users".* FROM "users"

	def impersonate
	  user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]