TeenServ/app/controllers/user_skills_controller.rb

INSERT INTO "user_skills" ("user_id", "skill_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["skill_id", 2], ["created_at", "2017-10-29 14:58:04.552254"], ["updated_at", "2017-10-29 14:58:04.552254"]]
---
  def create
    @userSkill = UserSkill.new(user_id: current_user.id, skill_id: params[:skill_id])
    @userSkill.save

SELECT  "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" = $1 AND "user_skills"."skill_id" = $2 LIMIT $3  [["user_id", 2], ["skill_id", 8], ["LIMIT", 1]]
DELETE FROM "user_skills" WHERE "user_skills"."id" = $1  [["id", 6]]
---
  def destroy
    @userSkill = UserSkill.find_by_user_id_and_skill_id(current_user.id, params[:skill_id])
    UserSkill.destroy(@userSkill.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @user = User.find(current_user.id)