TeenServ/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def new
		@user = User.find(params[:format])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "address_1" = $3, "address_2" = $4, "city" = $5, "province" = $6, "postal_code" = $7, "country" = $8, "profile_pic" = $9, "updated_at" = $10 WHERE "users"."id" = $11
---
	def edit
		@user = User.find(params[:id])
		@user.update_attributes(user_params)