app/views/users/show.html.erb

SELECT "services".* FROM "services" WHERE "services"."user_id" = $1 AND (services.status = 2)  [["user_id", 6]]
SELECT COUNT(*) FROM "services" WHERE "services"."user_id" = $1 AND (services.status = 0)  [["user_id", 7]]
---
                    </div>
                    <% if @user.services.status(Service::UNLISTED).count != 0 %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 7]]
---
                    </div>
                    <% if @user.reviews.count != 0 %>

SELECT "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" = $1  [["user_id", 6]]
---
                <hr>
                <% @userSkills = UserSkill.where(:user_id => @user.id) %>

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

                        <%= t Skill.find(skill.skill_id).skill_name %>

SELECT  1 AS one FROM "endorsements" WHERE "endorsements"."user_id" = $1 LIMIT $2  [["user_id", 7], ["LIMIT", 1]]
---
          <div class="tab-pane fade in well secondary" id="review_endorsementsTab">
            <% if current_user.endorsement_invites.map(&:user_id).include?(@user.id)  %>