app/views/user_skills/edit.html.erb

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <% @userSkills.each do |skill| %>
      <div class="skillNames"><%= Skill.find(skill.id).skill_name %><i class="fa fa-times removeSkill" aria-hidden="true"></i></div>