TeenServ/app/views/services/show.html.erb

<h3><%= @service.title %></h3>
<p>Posted By: <%= @service.user.first_name + ' ' + @service.user.last_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

		<table style="width:50%;text-align:center;background-color:#dfdfdf">
			<% if @service.service_users.size == 0%>
---
SELECT  "service_users".* FROM "service_users" WHERE "service_users"."service_id" = $1 ORDER BY "service_users"."id" ASC LIMIT $2  [["service_id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "service_users" WHERE "service_users"."service_id" = $1  [["service_id", 2]]

	<% elsif @service.user.group != current_user.group %>
		<% if @service.service_users.exists?(:user_id => current_user.id) %>
---
SELECT  1 AS one FROM "service_users" WHERE "service_users"."service_id" = $1 AND "service_users"."user_id" = $2 LIMIT $3  [["service_id", 2], ["user_id", 5], ["LIMIT", 1]]

<% elsif @service.status == Service::ACCEPTED %>
	<% @acceptedUser = User.find(@service.service_users.first.user_id) %>
---
SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]