TeenServ/app/views/user_skills/edit.html.erb

  <% @userSkills.each do |skill| %>
      <%= Skill.find(skill.id).skill_name %><br>
---
SELECT  "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" = $1 AND "user_skills"."skill_id" = $2 LIMIT $3  [["user_id", 2], ["skill_id", 1], ["LIMIT", 1]]