TeenServ/app/views/users/show.html.erb

SELECT  "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
                <h4><i class="fa fa-star" aria-hidden="true"></i> Skills</h4>
                <% @userSkills = UserSkill.where(:user_id => @user.id) %>

SELECT  "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                  <% @userSkills.each do |skill| %>
                      <%= Skill.find(skill.skill_id).skill_name %><br>

SELECT "services".* FROM "services" WHERE "services"."user_id" = $1 AND (services.status = 0)  [["user_id", 2]]
SELECT COUNT(*) FROM "services" WHERE "services"."user_id" = $1 AND (services.status = 0)  [["user_id", 2]]
---
                    <h4><i class="fa fa-cogs" aria-hidden="true"></i> Unlisted Services </h4>
                    <% if @user.services.status(Service::UNLISTED).count != 0 %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = $1  [["user_id", 2]]
---
                  </div>
                  <% if @user.reviews.count != 0 %>

SELECT  1 AS one FROM "endorsements" WHERE "endorsements"."user_id" = $1 LIMIT $2  [["user_id", 10], ["LIMIT", 1]]
---
      <div class="tab-pane fade in well secondary" id="review_endorsementsTab">
          <% if @current_user.endorsement_invites.map(&:user_id).include?(@user.id)  %>

SELECT  "teen_times".* FROM "teen_times" WHERE "teen_times"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
<script>
    $(document).ready(function() {
        displaySchedule();
        function displaySchedule(){
          <% if @teenDays.empty? %>
            $(".schedule").append("<div class='noAvaib'>This user didn't add his availability</div>");
          <% else %>
            <% @teenDays.each do |day| %>
              $(".schedule").append("<div class='col-md-2 <%= day.day %>'><%= day.day %> <br></div>");
            <% end %>
            <% @teenTime.each do |time| %>
              $(".<%= time.day %>").append("<%= time.start_time.strftime("%I:%M %p") %> - <%= time.end_time.strftime("%I:%M %p") %><br>");
            <% end %>
          <% end %>
        }
        $(".btn-pref .btn").click(function () {
            $(".btn-pref .btn").removeClass("btn-primary").addClass("btn-default");
            $(this).removeClass("btn-default").addClass("btn-primary");
            $(".primary").removeClass('active');
            $(".secondary").removeClass('active');
            switch($(this)[0].id){
                case 'about':