app/controllers/cards_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "stripe_id" = $1, "longitude" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["stripe_id", "cus_BoPHHXSYjVmfCe"], ["longitude", -79.38333589999999], ["updated_at", "2017-11-22 00:52:11.180393"], ["id", 2]]
---
  def create

    @user = User.find(current_user.id)

    if !@user.stripe_id.blank?

      customer = Stripe::Customer.retrieve(@user.stripe_id)

      cards = Stripe::Customer.retrieve(customer.id).sources.all(:object => "card")

      customer.sources.retrieve(cards.data[0].id).delete

      customer.source = params[:stripeToken]

      customer.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index

    @user = User.find(params[:user_id])