app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "teen_times".* FROM "teen_times" WHERE "teen_times"."user_id" = $1  [["user_id", 1]]
SELECT "user_skills".* FROM "user_skills" WHERE "user_skills"."user_id" = $1  [["user_id", 1]]
SELECT  "services".* FROM "services" WHERE "services"."user_id" = $1 ORDER BY created_at DESC LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "services".* FROM "services" WHERE "services"."user_id" = $1 AND "services"."status" = $2  [["user_id", 2], ["status", 2]]
---
  def index
    if current_user
      @user = User.find(current_user.id)
      if @user.is_teen?

        @recommended_services = Service.find_by_sql("SELECT S.ID,S.TITLE,S.CHARGE_PER_HOUR,S.FREQUENCY,S.DESCRIPTION FROM SERVICES S JOIN
  (SELECT U.SKILL_ID,U.USER_ID,DAY,START_TIME,END_TIME FROM USER_SKILLS U JOIN TEEN_TIMES T ON (U.USER_ID=T.USER_ID AND U.USER_ID=#{@user.id})) A
    ON (S.STATUS=1 AND S.SKILL=A.SKILL_ID AND (#{@user.age} BETWEEN MIN_AGE AND MAX_AGE) AND S.START_TIME>=A.START_TIME AND S.END_TIME<=A.END_TIME)")

        @user_skills = UserSkill.where(user_id: @user.id)
        @user_availability =  TeenTime.where(user_id: @user.id)
      elsif @user.is_client?
        @latest_service = Service.where(user_id: @user.id).order('created_at DESC').limit(1)
        @current_services = Service.where(user_id: @user.id , status:2)