app/controllers/search_controller.rb

  def search
    @services = Service.search(params[:search_term])
---
SELECT "services".* FROM "services" WHERE (title ILIKE '%j%') ORDER BY created_at DESC