app/controllers/services_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
	def index
		$distance_filter = -1
		$from_age_filter = -1
		$to_age_filter = -1

		@services = Service.status(Service::LISTED).viewable_services(current_user)

		@user = User.find(current_user.id)

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
	def show
		@service = Service.find(params[:id])
		@user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
INSERT INTO "services" ("user_id", "title", "charge_per_hour", "created_at", "updated_at", "status", "frequency", "min_age", "max_age", "other_title", "description", "skill", "duration", "date", "start_time", "end_time", "day") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
	def create
		@service = Service.new(service_params)

    if @service.address_1.blank?
      @user = User.find(current_user.id)
      @service.address_1 = @user.address_1
      @service.address_2 = @user.address_2
      @service.city = @user.city
      @service.country = @user.country
      @service.province = @user.province
      @service.postal_code = @user.postal_code
      @service.save!

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "services" WHERE "services"."id" = $1  [["id", 2]]
---
	def destroy
		@service = Service.find(params[:id])
		user_id = @service.user_id
		service_id = @service.id
		@service.destroy

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "services" SET "status" = $1, "updated_at" = $2 WHERE "services"."id" = $3  [["status", 1], ["updated_at", "2017-11-18 03:34:38.871259"], ["id", 6]]
---
	def list
		@service = Service.find(params[:id])
		@service.update({:status => Service::LISTED});

SELECT  "services".* FROM "services" WHERE "services"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def unlist
		@service = Service.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
	def find_user
		if params[:user_id]
			@user = User.find(params[:user_id])