app/controllers/teen_times_controller.rb

INSERT INTO "teen_times" ("user_id", "day", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 6], ["day", "Monday"], ["start_time", "00:00:00"], ["end_time", "00:00:00"], ["created_at", "2017-11-18 02:26:43.841488"], ["updated_at", "2017-11-18 02:26:43.841488"]]
---
  def create
    @check = TeenTime.find_by_day_and_user_id_and_end_time(params[:day], @user.id, params[:start_time])
    if @check.blank?
      @TeenTime = TeenTime.new(user_id: @user.id, day: params[:day], start_time: params[:start_time], end_time: params[:end_time])
      unless @teenTime.save

DELETE FROM "teen_times" WHERE "teen_times"."id" = $1  [["id", 1]]
SELECT "teen_times".* FROM "teen_times" WHERE "teen_times"."user_id" = $1 AND "teen_times"."day" = $2 AND "teen_times"."start_time" = $3 AND "teen_times"."end_time" = $4  [["user_id", 6], ["day", "Monday"], ["start_time", "00:00"], ["end_time", "00:00"]]
SELECT "teen_times".* FROM "teen_times" WHERE "teen_times"."user_id" = $1 AND "teen_times"."day" = $2  [["user_id", 1], ["day", "Tuesday"]]
---
  def destroy
    if params[:start_time]
      TeenTime.where(:user_id => @user.id).where(:day => params[:day]).where(:start_time => Time.parse(params[:start_time]).strftime("%H:%M")).where(:end_time => Time.parse(params[:end_time]).strftime("%H:%M")).destroy_all
    else
      TeenTime.where(:user_id => @user.id).where(:day => params[:day]).destroy_all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def find_user
      @user = User.find(current_user.id)