app/controllers/transactions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_user
    if params[:user_id]
      @user = User.find(params[:user_id])