app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def login_as
    @users = User.where.not(id: current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
	def impersonate
	  user = User.find(params[:id])